-- ******************************** 7 ********************************
-- Вывести список студентов, имеющих одинаковые отчества, но не совпадающие ид.
SELECT *
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE "ЧЛВК_ИД" IN (SELECT "ИД"
                    FROM "Н_ЛЮДИ"
                    WHERE "ОТЧЕСТВО" IN (SELECT "ОТЧЕСТВО" FROM "Н_ЛЮДИ" GROUP BY  "ОТЧЕСТВО" HAVING count("ОТЧЕСТВО") > 1)
                      AND "ИД" IN (SELECT "ИД" FROM "Н_ЛЮДИ" GROUP BY "ИД" HAVING count("ИД") = 1));